org/openstack.org
:PROPERTIES:
:ID:       29C3758F-BA4D-40E4-B7F0-4C51D3FFC830
:END:
#+HUGO_BASE_DIR: ../
#+TITLE: OpenStack
#+DATE: <2021-05-01 Sat 16:58>
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_TAGS: openstack
#+HUGO_CATEGORIES: 
#+HUGO_DRAFT: false
* FAQ
- [[id:6FB8F918-F7D7-4BCF-8F81-FF21A792B7BA][How to make image?]]
* TODO
** What is the Cloud Image?
** Boot an instance from an ISO image
https://docs.openstack.org/ocata/user-guide/cli-nova-launch-instance-using-ISO-image.html
* Troubleshooting
The main troubleshooting method about OpenStack is checking through the [[id:AAF7022E-1458-4C94-8B99-5871D3416FA9][logs]].
* Network
** What is physical network in OpenStack?
The OpenStack Networking services can either run together on the same physical
server, or on separate dedicated servers, which are named according to their
roles:
- Controller node - The server that runs API service.
- Network node - The server that runs the OpenStack Networking agents.
** L2GW
